opensoap/samples/ShoppingSec/SampleMessages/GetProductSpecSecReq.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <m:GetProductSpec
         xmlns:m="http://services.opensoap.jp/samples/ShoppingSec/">
            <index>10</index>
        </m:GetProductSpec>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
